Autotest(Работает)s:


Autotest(Работает)001: 

Внутри класса Answer напишите метод CompareNumbers, который на вход принимает два числа и выводит, какое число большее, а какое меньшее.

Пример использования:

На входе:

firstNumber: '5'
secondNumber: '6'

На выходе:

Первое число `5` меньше чем второе число `6`

На входе:

firstNumber: '3'
secondNumber: '6'

На выходе:

Первое число `3` меньше чем второе число `6`

На входе:

firstNumber: '3'
secondNumber: '3'

На выходе:

Введенные числа равны `3`



Autotest(Работает)002:

Внутри класса Answer напишите метод FindMax, который принимает на вход три числа и выдаёт максимальное из этих чисел.



Autotest(Работает)003:

Внутри класса Answer напишите метод CheckIfEven, который на вход принимает число number и выводит, является ли число чётным (делится ли оно на два без остатка).

Пример использования:
На входе:

number: '6'

На выходе:

Число `6` чётное

На входе:

number: '3'

На выходе:

Число `3` нечётное


Autotest(Работает)004:

Внутри класса Answer напишите метод PrintEvenNumbers, которая на вход принимает число (number), а на выходе выводит все чётные числа от 1 до number (включительно), разделеные знаком табуляции.

number = 5 -> 2    4

number = 8 -> 2    4    6    8


Autotest(Пусто)005:

Внутри класса Answer напишите метод IsPalindrome, который принимает на вход пятизначное число number и проверяет, является ли оно палиндромом.

Метод должен проверить является ли число пятизначным, в противном случае - вывести Число не пятизначное и False в следующей строке.

Для остальных чисел вернуть True или False.

14212 -> False
12821 -> True
234322 -> Число не пятизначное
                     False


Autotest(Пусто)006:

Внутри класса Answer напишите метод DistanceBetweenPoints, который принимает на вход координаты двух точек pointA и pointB в виде массива целых чисел, и возвращает расстояние между ними в 3D пространстве.

A (3,6,8); B (2,1,-7) -> 15.84
A (7,-5, 0); B (1,-1,9) -> 11.53


Autotest(Пусто)007:

Внутри класса Answer напишите метод ShowCube, который принимает на вход число (N) и выводит таблицу кубов чисел от 1 до N (включительно) каждое на новой строке.

N = 3 
/*
1
8
27
*/

N = 5
/*
1
8
27
64
125
*/



task(Работает)00.

Напишите программу, которая на вход принимает число и выдаёт его квадрат (число умноженное на само себя).




task(Работает)01. 

Напишите программу, которая на вход принимает два числа и проверяет, 
является ли первое число квадратом второго. 

a = 25; b = 5 -> да
a = 2 b = 10 -> нет
a = 9; b = -3 -> да
a = -3 b = 9 -> нет





task(Работает)02. 

Внутри класса Answer напишите метод CompareNumbers,
который на вход принимает два числа и выводит,
какое число большее, а какое меньшее.

a = 5; b =7 -> Первое число 5 меньше чем второе число 7

a = 3; b = 2 -> Введение числа равны 2





task(Работает)03. 

Напишите программу, которая будет выдавать название дня недели по заданному номеру.





task(Работает)04. 

Внутри класса Answer напишите метод FindMax,
который принимает на вход три числа и выдаёт максимальное из этих чисел.





task(Работает)05.

Напишите программу, которая на вход принимает одно число (N), а на выходе показывает все целые числа в промежутке от -N до N. 
 4 -> "-4, -3, -2, -1, 0, 1, 2, 3, 4"
 2 -> " -2, -1, 0, 1, 2"





task(Работает)06.

Внутри класса Answer напишите метод CheckIfEven, 
который на вход принимает число number и выводит,
является ли число чётным.
Делится оно на два без остатка



task(Работает)07.

Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает последнюю цифру этого числа.

456 -> 6
782 -> 2
918 -> 8





task(Работает)08.

Напишите программу которая на вход принимает число (number), 
а на выходе выводит все чётные числа от 1 до number (включительно), 
разделеные знаком табуляции.





task(Работает)09.

Напишите программу, 
которая выводит случайное число из отрезка [10, 99] 
и показывает наибольшую цифру числа.

78 -> 8
12 -> 2
85 -> 8





task(Работает)10.

Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
456 -> 5
782 -> 8
918 -> 1

 только 2 условия из 3


task(Работает)11.

Напишите программу, 
которая выводит случайное трёхзначное число
и удаляет вторую цифру этого числа. 

456 ->46 
782 ->72
918 ->98





task(Работает)12.

Напишите программу, которая будет принимать на вход два числа и выводить, 
является ли второе число кратным первому. 
Если второе число некратно первому, то программа выводит остаток от деления.

34, 5 -> некратно, остаток 4
16, 4 -> кратно





task(Работает)13.

Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
645 -> 5
78 -> третьей цифры нет
32679 -> 6



task(Работает)14.

Напишите программу, 
которая принимает на вход число и проверяет, 
кратно ли оно одновременно 7 и 23.

14 -> нет
46 -> нет
161 -> да



task(Работает)15.

Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
6 -> да
7 -> да
1 -> нет





task(Работает)16.

Напишите программу, которая принимает на вход два числа и проверяет, 
является ли одно число квадратом другого.
5, 25 -> да
-4, 16 -> да
25, 5 -> да
8,9 -> нет


task(Работает)17.

Напишите программу, которая принимает на вход координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0
и выдаёт номер четверти плоскости, в которой находится эта точка.
x=34; y=-30 -> 4 
x=2; y=4-> 1
x=-34; y=-30 -> 3

task(Работает)18.

Напишите программу, которая по заданному номеру четверти, показывает диапазон
возможных координат точек в этой четверти (x и y).

task(Пусто)19.

Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.

task(Работает)20.

Напишите программу, которая принимает на вход координаты двух точек и находит
расстояние между ними в 2D пространстве.

A (3,6); B (2,1) -> 5,09
A (7,-5); B (1,-1) -> 7,21


task(Пусто)21.

Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.

task(Работает)22.

Напишите программу, которая принимает на вход число (N) и выдаёт таблицу квадратов чисел от 1 до N.

5 -> 1, 4, 9, 16, 25.
2 -> 1,4


task(Пусто)23.

Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.













using System;

class Program
{
    static void Main(Работает)
    {
        Console.Write("Введите число N: ");
        int N = Convert.ToInt32(Console.ReadLine(Работает));

        Console.Write("Результат: ");
        for (int i = -N; i <= N; i++)
        {
            Console.Write(i);
            if (i != N)
            {
                Console.Write(", ");
            }
        }

        Console.WriteLine(Работает);
    }
}









