Tasks:

task00. Напишите программу, которая на вход принимает число и выдаёт его квадрат (число умноженное на само себя).

Работает

task01. Напишите программу, которая на вход принимает два числа и проверяет, 
является ли первое число квадратом второго. 

a = 25; b = 5 -> да
a = 2 b = 10 -> нет
a = 9; b = -3 -> да
a = -3 b = 9 -> нет

Работает



task02. Внутри класса Answer напишите метод CompareNumbers,
который на вход принимает два числа и выводит,
какое число большее, а какое меньшее.

a = 5; b =7 -> Первое число 5 меньше чем второе число 7

a = 3; b = 2 -> Введение числа равны 2

Работает



task03. День недели if(), if else() 

Работает



task04. Внутри класса Answer напишите метод FindMax,
который принимает на вход три числа и выдаёт максимальное из этих чисел.

Работает



task05. Напишите программу, которая на вход принимает одно число (N), а на выходе показывает все целые числа в промежутке от -N до N. 
 4 -> "-4, -3, -2, -1, 0, 1, 2, 3, 4"
 2 -> " -2, -1, 0, 1, 2"

Работает



task06. Внутри класса Answer напишите метод CheckIfEven, 
который на вход принимает число number и выводит,
является ли число чётным.
Делится оно на два без остатка

Работает

task07. Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает последнюю цифру этого числа.

456 -> 6
782 -> 2
918 -> 8

Работает



task08. Напишите программу которая на вход принимает число (number), 
а на выходе выводит все чётные числа от 1 до number (включительно), 
разделеные знаком табуляции.

Работает



task09. Напишите программу, 
которая выводит случайное число из отрезка [10, 99] 
и показывает наибольшую цифру числа.

78 -> 8
12 -> 2
85 -> 8

Работает



task10. Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
456 -> 5
782 -> 8
918 -> 1

Работает только 2 условия из 3


task11. Напишите программу, 
которая выводит случайное трёхзначное число
и удаляет вторую цифру этого числа. 

456 ->46 
782 ->72
918 ->98

Работает



task12. Напишите программу, которая будет принимать на вход два числа и выводить, 
является ли второе число кратным первому. 
Если второе число некратно первому, то программа выводит остаток от деления.

34, 5 -> некратно, остаток 4
16, 4 -> кратно

Работает



task13. Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
645 -> 5
78 -> третьей цифры нет
32679 -> 6

Пусто

task14. Напишите программу, 
которая принимает на вход число и проверяет, 
кратно ли оно одновременно 7 и 23.

14 -> нет
46 -> нет
161 -> да

Работает

task15. Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
6 -> да
7 -> да
1 -> нет

Работает



task16. Напишите программу, которая принимает на вход два числа и проверяет, 
является ли одно число квадратом другого.
5, 25 -> да
-4, 16 -> да
25, 5 -> да
8,9 -> нет

Работает


















Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
6 -> да
7 -> да
1 -> нет






using System;

class Program
{
    static void Main()
    {
        Console.Write("Введите число N: ");
        int N = Convert.ToInt32(Console.ReadLine());

        Console.Write("Результат: ");
        for (int i = -N; i <= N; i++)
        {
            Console.Write(i);
            if (i != N)
            {
                Console.Write(", ");
            }
        }

        Console.WriteLine();
    }
}









